## Production: secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.freshdesk_api_key`                    |
|        | `aws_secretsmanager_secret.notify_api_key`                       |
|        | `aws_secretsmanager_secret.notify_callback_bearer_token`         |
|        | `aws_secretsmanager_secret.recaptcha_secret`                     |
|        | `aws_secretsmanager_secret.token_secret`                         |
|        | `aws_secretsmanager_secret_version.freshdesk_api_key`            |
|        | `aws_secretsmanager_secret_version.notify_api_key`               |
|        | `aws_secretsmanager_secret_version.notify_callback_bearer_token` |
|        | `aws_secretsmanager_secret_version.recaptcha_secret`             |
|        | `aws_secretsmanager_secret_version.token_secret`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.freshdesk_api_key will be created
  + resource "aws_secretsmanager_secret" "freshdesk_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "freshdesk_api_key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_secretsmanager_secret.notify_api_key will be created
  + resource "aws_secretsmanager_secret" "notify_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "notify_api_key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_secretsmanager_secret.notify_callback_bearer_token will be created
  + resource "aws_secretsmanager_secret" "notify_callback_bearer_token" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "notify_callback_bearer_token"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_secretsmanager_secret.recaptcha_secret will be created
  + resource "aws_secretsmanager_secret" "recaptcha_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "recaptcha_secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_secretsmanager_secret.token_secret will be created
  + resource "aws_secretsmanager_secret" "token_secret" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "token_secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_secretsmanager_secret_version.freshdesk_api_key will be created
  + resource "aws_secretsmanager_secret_version" "freshdesk_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.notify_api_key will be created
  + resource "aws_secretsmanager_secret_version" "notify_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.notify_callback_bearer_token will be created
  + resource "aws_secretsmanager_secret_version" "notify_callback_bearer_token" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.recaptcha_secret will be created
  + resource "aws_secretsmanager_secret_version" "recaptcha_secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.token_secret will be created
  + resource "aws_secretsmanager_secret_version" "token_secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + freshdesk_api_key_secret_arn            = (known after apply)
  + notify_api_key_secret_arn               = (known after apply)
  + notify_api_key_secret_value             = (sensitive value)
  + notify_callback_bearer_token_secret_arn = (known after apply)
  + recaptcha_secret_arn                    = (known after apply)
  + token_secret_arn                        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.freshdesk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_callback_bearer_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.recaptcha_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.token_secret"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
